{
  "format": "layers-model",
  "generatedBy": "TensorFlow.js v3.18.0",
  "convertedBy": "TensorFlow.js Converter v3.18.0",
  "modelTopology": {
    "keras_version": "2.9.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "batch_input_shape": [null, 1],
              "dtype": "float32",
              "units": 64,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 32,
              "activation": "relu"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 1,
              "activation": "linear"
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "mean_squared_error",
      "metrics": null,
      "weighted_metrics": null,
      "loss_weights": null,
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.001
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        {"name": "dense/kernel", "shape": [1, 64], "dtype": "float32"},
        {"name": "dense/bias", "shape": [64], "dtype": "float32"},
        {"name": "dense_1/kernel", "shape": [64, 32], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [32], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [32, 1], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [1], "dtype": "float32"}
      ]
    }
  ]
}